Revit 2027 API
ParameterFilterElement.AllRuleParametersApplicable(ElementFilter) Method
 Checks that the parameters of the rules used by the given ElementFilter are valid for this filter's categories.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AllRuleParametersApplicable(
	ElementFilter elementFilter
)
Public Function AllRuleParametersApplicable (
	elementFilter As ElementFilter
) As Boolean
public:
bool AllRuleParametersApplicable(
	ElementFilter^ elementFilter
)
member AllRuleParametersApplicable :
        elementFilter : ElementFilter -> bool
Parameters
elementFilter ElementFilter
 The ElementFilter containing the rules to check.
Return Value
Boolean
 True if all the parameters of the given rules are valid for this filter, otherwise false.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ParameterFilterElement Class
AllRuleParametersApplicable Overload
Autodesk.Revit.DB Namespace